import 'package:flutter/material.dart';

class Constants {
  static const String imgBasePath = "assets/Images/",
      baseApiUrl = "https://livewritten.com/";

  static late double height, width;


  static const String expertWhat = '''
<h1><strong>Expert Review কী?</strong></h1>
<p>Expert Review-টি <strong>CrackTech&trade;</strong> এর নতুন একটি ধারণা। বিসিএস ক্যাডার, নন-ক্যাডার ও একাধিকবার বিসিএস ভাইভায় উত্তীর্ণ এক্সপার্টদের সমন্বয়ে একটি &ldquo;<strong>Expert Panel</strong>&rdquo; গঠন করা হয়েছে।</p>
<p>এই প্যানেল থেকে একজন পরীক্ষার্থী পরীক্ষায় অংশগ্রহণ করার পর উক্ত বিষয়ের <strong>অভিজ্ঞ শিক্ষক বা এক্সপার্ট</strong> দ্বারা তার উত্তরপত্র মূল্যায়ন করিয়ে নিতে পারবেন।</p>
<p>এটি একটি <strong>পেইড সার্ভিস</strong>। একজন পরীক্ষার্থী মূল লিখিত পরীক্ষায় যদি ভালো ফলাফল করতে চান, তাহলে উত্তরপত্রের কোথায় কিভাবে উন্নতি করতে হবে, ভালো উত্তরপত্র লেখার জন্য কোন জায়গাগুলোতে নজর দিতে হবে তা <strong>বিশ্লেষণ</strong> করে <strong>প্রফেশনাল/এক্সপার্ট সাজেশন</strong> দরকার হবে।</p>
<p>উত্তরপত্র যথাযথভাবে মূল্যায়ন একটা <strong>সময়সাপেক্ষ এবং গুরুত্বপূর্ণ</strong> বিষয়। এখানে একজন পরীক্ষক যথেষ্ট সময় নিয়ে উত্তরপত্র মূল্যায়নের কাজটি করেন যা তাঁর <strong>দায়িত্বশীলতার</strong> পরিচয় বহন করে।</p>
<p>পরীক্ষকের দায়িত্বশীলতা নিশ্চিত করার জন্য আমাদের <strong>Expert Panel</strong> থেকে কোনো উত্তরপত্র মূল্যায়নের সময় পরীক্ষার্থী পরীক্ষকের সময়ের মূল্য/সম্মানী পরিশোধের পাশাপাশি, তিনি কতটা গুরুত্ব দিয়ে উত্তরপত্র মূল্যায়ন করেছেন তার সাপেক্ষে পরীক্ষার্থী পরীক্ষককে <strong>রেটিং ও কমেন্ট</strong> দিতে পারছেন। সকল ধরণের ওপেন মার্কেটপ্লেসে রেটিং কতটা গুরুত্বপূর্ণ সেটা নিশ্চয়ই আপনারা সকলেই জানেন।</p>
<p>এই রেটিং সিস্টেমের জন্য পরীক্ষকের দায়িত্ব অনেকখানি বেড়ে যাবে; কারণ রেটিং খারাপ আসলে তাঁকে দিয়ে পরীক্ষার্থীগণ উত্তরপত্র মূল্যায়ন করতে ইচ্ছুক হবেন না। আর তাই পরীক্ষক অবশ্যই দায়িত্ব নিয়ে গুরুত্ব সহকারে প্রতিটি উত্তরপত্র মূল্যায়ন করবেন।</p>
<p>সবমিলিয়ে, একজন পরীক্ষার্থী যেনো সহজেই তার উত্তরপত্রের <strong>মানোন্নয়নে</strong> এক্সপার্টদের সরাসরি সাহায্য পেতে পারেন, তাদের জন্যই &ldquo;<strong>Live Written Expert Panel</strong>&rdquo; গঠন করা হয়েছে।</p>
<h1><strong>শিক্ষক ও এক্সপার্ট রিভিউ:</strong></h1>
<p>অভিজ্ঞ শিক্ষক ও এক্সপার্টরা উত্তরপত্র দেখে পরীক্ষার্থীকে কোথায় উন্নতি করতে হবে, তা পুঙ্খানুপুঙ্খভাবে <strong>বিশ্লেষণ</strong> করে উক্ত উত্তরপত্রটি সম্পর্কে মন্তব্য, পরামর্শ ও মূল পরীক্ষায় ভাল করার <strong>সাজেশন</strong> দিয়ে তাদের মতামত জানাবেন।&nbsp;</p>
<p>এতে করে পরীক্ষার্থী তার ভুলগুলো শুধরে নিয়ে মূল পরীক্ষায় ভালো করার প্রয়াস পাবেন।</p>
<h1><strong>ইউজার রেটিং কী:</strong></h1>
<p>অভিজ্ঞ শিক্ষক বা এক্সপার্টগণ যথাযথভাবে উত্তরপত্র মুল্যায়ন করার পর পরীক্ষার্থী উক্ত পরীক্ষককে <strong>রেটিং ও মন্তব্যের </strong>মাধ্যমে তাঁর মতামত জানাতে পারবেন।&nbsp;</p>
<p>এতে করে শিক্ষক ও এক্সপার্টগণ তাদের রেটিং ভালো রাখার জন্য সর্বদা সচেষ্ট থাকবেন। আর সেজন্য তারা অবশ্যই প্রতিটি উত্তরপত্র গুরুত্ব ও যত্নসহকারে মূল্যায়ন করে ভালো রেটিং অর্জনের চেষ্টা করবেন।</p>
<p>যেহেতু রেটিং প্রদান খুব গুরুত্বপূর্ণ একটি বিষয়, তাই পরীক্ষার্থীগণও গুরুত্বসহকারে রেটিং প্রদান করবেন বলে আমরা বিশ্বাস করি।</p>
<h1><strong>পরীক্ষার্থী Expert Panel থেকে কীভাবে সেবা নিবেন:</strong></h1>
<ul>
<li>পরীক্ষা শেষে উত্তরপত্র সাবমিটের পর Live Written Expert Panel থেকে শিক্ষক ও এক্সপার্টদের লিস্ট দেখা যাবে। একজন পরীক্ষার্থী এই লিস্ট থেকে পছন্দ মতো যেকোনো শিক্ষক বা এক্সপার্ট এর নিকট তাঁর উত্তরপত্রটি মূল্যায়নের জন্য প্রেরণ করতে পারবেন।</li>
</ul>
<p>উল্লেখ্য, প্রতিটি উত্তরপত্র মূল্যায়নের জন্য <strong>সম্মানী/ফি</strong> এক্সপার্টগণ নিজেরাই নির্ধারণ করে থাকেন, Live Written কর্তৃপক্ষ এটি নির্ধারণ করেন না।&nbsp;</p>
<p>এবং, Live Written কর্তৃপক্ষ পরীক্ষকদের <strong>সম্মানী</strong> থেকে কোন <strong>চার্জ নেয় না</strong>।</p>
<ul>
<li>Expert Panel থেকে উত্তরপত্র মূল্যায়নের জন্য পরীক্ষার্থী তাঁর একাউন্টে <strong>অগ্রিম ব্যাল্যান্স লোড</strong> করে রাখতে পারবেন এবং নিজের সুবিধা অনুসারে ব্যালেন্স খরচ করে উত্তরপত্র মূল্যায়ন করতে পারবেন।</li>
</ul>
<p>অর্থাৎ পরীক্ষার্থী প্রতিবার <strong>সিঙ্গেল পেমেন্ট</strong> করে মূল্যায়ন করাতে পারবেন আবার চাইলে <strong>অগ্রিম ব্যাল্যান্স লোড</strong> করে রেখে সেখান থেকে মূল্যায়নের জন্য পাঠানোর সময় পেমেন্ট করতে পারবেন।</p>
<ul>
<li>মূল্যায়নের জন্য পাঠানোর পর যদি কোন শিক্ষক/এক্সপার্ট নির্দিষ্ট সময়ের মধ্যে উত্তরপত্র <strong>না দেখেন বা রিজেক্ট</strong> করেন তাহলে আপনার নির্ধারিত ব্যালেন্স আবার আপনার একাউন্ট-এ ফেরত চলে যাবে।</li>
</ul>
<p>উল্লেখ্য, <strong>Expert Panel</strong> থেকে উত্তরপত্র মূল্যায়ন করা <strong>বাধ্যতামূলক নয়</strong>।</p>
<p>উত্তরপত্র মূল্যায়ন এর জন্য সবাই <strong>ফ্রি-তে Peer to Peer (P2P) review সিস্টেম</strong> এর সুবিধা নিতে পারবেন।</p>
<p>উত্তরপত্র দেখে শুধু মার্ক দিয়ে দায়সারা মূল্যায়ন যেনো না হয় এবং পরীক্ষার্থীগণ চাইলেই শিক্ষক/এক্সপার্টদের মূল্যায়নও যাতে পেতে পারেন সেজন্যই আমাদের <strong>Expert Panel চালু করা হয়েছে।</strong></p>
<p>নিয়মিত পরীক্ষা দেয়ার পাশাপাশি যথাযথ মূল্যায়নও প্রস্তুতির একটা গুরুত্বপূর্ণ ধাপ। আশা করি আমাদের <strong>Expert Panel </strong>ফিচারটি আপনাদের প্রস্তুতিতে এবং উত্তরপত্রের মানোন্নয়নে সহায়তা করবে।</p>
  ''';

static const String p2pWhat = '''
<h1><strong>Peer-to-Peer Review কী?</strong></h1>
<p>Live Written অ্যাপে একটি পরীক্ষাতে যারা অংশগ্রহণ করবেন তারা একে অন্যের খাতা মূল্যায়ন করে দিতে পারবেন। আমরা এটাকেই Peer-to-Peer Review বা P2P Review বলছি।</p>
<p>যারা পরীক্ষা দিচ্ছেন তাদের মধ্য থেকে <strong>অনেকেই ক্যাডার সার্ভিসে</strong> যাবেন কিংবা অনেকেই আছেন যাদের দু-তিনটা <strong>রিটেনের পূর্ব অভিজ্ঞতাও</strong> আছে।&nbsp;</p>
<p>তাই, <strong>এক্সপার্ট তথা শিক্ষকদেরকে ফি</strong> দিয়ে খাতা মূল্যায়নের পাশাপাশি নিজেরা একে অন্যের খাতা মূল্যায়ন করে দেয়াটাও এখানে যথেষ্ট গুরুত্ব বহন করে।</p>
<h1><strong>Peer-to-Peer Review এর সুবিধাসমূহ:</strong></h1>
<p>১) উত্তরপত্রের <strong>ফ্রি</strong> মূল্যায়ন। মূল্যায়নের জন্য এখানে আলাদা <strong>কোন ফি দিতে হচ্ছে না</strong>।</p>
<p>২) আপনার উত্তরপত্রের সঙ্গে অন্যদের উত্তরপত্রের <strong>তুলনামূলক Study</strong> করে নিতে পারবেন। <strong>ইম্প্রুভমেন্টের</strong> সুযোগ পাবেন।</p>
<p>৩) আপনি যে পয়েন্টগুলো মিস করেছেন সেগুলো দেখে শিখে নিতে পারবেন। এক কথায় বললে, <strong>অনেকের উত্তরপত্র বিশ্লেষণের</strong> মাধ্যমে যেকোনো টপিকে আপনার দৃষ্টিভঙ্গি প্রসারিত করার সুযোগ পাচ্ছেন।</p>
<h2><strong>কেন আপনি অন্যের খাতা দেখবেন কিংবা অন্যরা কেন আপনাদের খাতা দেখে দিবেন?</strong></h2>
<p><strong>Peer-to-Peer Review</strong> সিস্টেমে অংশগ্রহণ করাটা <strong>বাধ্যতামূলক নয়।</strong></p>
<p>তবে, আপনি যদি চান যে আপনার খাতা অন্যরা <strong>ফ্রিতে</strong> মূল্যায়ন করে দিক তাহলে আপনাকে অন্যের খাতা মূল্যায়ন করতে হবে।</p>
<h1><strong>Peer-to-Peer </strong>Review System পুরোটিই একটি <strong>Credit </strong>ভিত্তিক<strong> অটোমেটিক </strong>প্রক্রিয়া।</h1>
<h1><strong>প্রাথমিক ক্রেডিট ৫০</strong></h1>
<ul>
<li>অ্যাপ ইন্সটল করার পর আপনাদের একাউন্ট এ সয়ংক্রিয়ভাবে <strong>৫০ ক্রেডিট</strong> যুক্ত হয়ে যাবে।</li>
</ul>
<h1><strong>ক্রেডিট মাইনাস</strong></h1>
<ul>
<li>উত্তরপত্র জমা বা সাবমিট করার পর আপনার উত্তরপত্র <strong>৪ জন Peer</strong> এর কাছে মূল্যায়নের জন্য পাঠানো হবে।</li>
</ul>
<p>আপনার ক্রেডিট ব্যালান্স থেকে <strong>উত্তরপত্র প্রতি ৫ ক্রেডিট </strong>করে কেটে নেয়া হবে।&nbsp;</p>
<ul>
<li>অর্থাৎ, <strong>৪ জন Peer</strong> এর কাছে উত্তরপত্র মুল্যায়নের জন্য <strong>২০ ক্রেডিট কেটে নেয়া</strong> হবে।</li>
<li><strong>শূন্য/খালি উত্তরপত্র</strong> কারও কাছে মূল্যায়নের জন্য <strong>পাঠানো হবে না</strong>।</li>
</ul>
<h1><strong>ক্রেডিট অর্জন</strong></h1>
<ul>
<li>কেউ কোন উত্তরপত্র মূল্যায়ন করে সাবমিট করলে, যার উত্তরপত্র মূল্যায়ন করা হলো তিনি রেটিং দিবেন।</li>
<li>মূল্যায়নের রেটিং হবে <strong>১০ স্কেলে</strong>।</li>
<li>১০ এ কাউকে ৭ রেটিং দেয়া হলে তিনি <strong>৭ Peer-to-Peer (P2P) Credit ব্যালান্স</strong> হিসেবে পাবেন।</li>
<li>অর্থাৎ, আপনার একটা খাতা দেখাতে যেখানে ৫ ক্রেডিট খরচ হলো সেখানে খাতা দেখে আপনার ১০ ক্রেডিট পর্যন্ত অর্জনের সুযোগ আছে।</li>
<li><strong>রেটিং দেয়া বাধ্যতামূলক করা হবে।</strong></li>
</ul>
<h1><strong>বিশেষভাবে লক্ষ্যনীয় বিষয়:</strong></h1>
<ul>
<li>আপনি যদি <strong>Peer to Peer</strong> - এ অন্য পরীক্ষার্থীর উত্তরপত্র মূল্যায়ন না করেন, তাহলে আপনার প্রোফাইলের ক্রেডিট শেষ হয়ে যাওয়ার পর আর নতুন করে কাউকে দিয়ে <strong>ফ্রি মূল্যায়ন করতে পারবেন না</strong>। অর্থাৎ ফ্রি উত্তরপত্র মূল্যায়নের সুযোগ আর থাকবে না।</li>
<li>ক্রেডিট শেষ হয়ে গেলে মার্কেট প্লেস থেকে শুধু টাকা খরচ করে এক্সপার্ট দ্বারা উত্তরপত্র মূল্যায়ন করতে পারবেন।</li>
<li>তাই, যে উত্তরপত্রগুলো রিভিউ করার জন্য আপনার নিকট যাবে, সেগুলো ভালো করে গুরুত্ব দিয়ে মূল্যায়ন করুন।</li>
</ul>
''';

}

class FontColor {
  static const Color buttonPrimary = Color(0xff50C2C9);
  static const Color buttonGreen = Color(0xff1AB67E);
  static const Color left = Color(0xffEDEDED);

  static const Color bottomColor = Color.fromARGB(255, 211, 208, 208);
}

